input_name = 'Введите имя контакта: '
input_phone = 'Введите телефон контакта: '
input_comment = 'Введите комментарий к контакту: '
input_search = 'Введите слово по которому будет осуществляться поиск: '
input_select = 'Выберите пункт меню: '
input_delete = 'Введите ID контакта для удаления: '
input_replace = 'Введите ID контакта для изменения: '

print_save = '\nТелефонная книга успешно сохранена!'
print_input = '\nТелефонная книга успешно загружена!'
print_error = 'Ошибка ввода, введите ЧИСЛО от 1 до 8'
print_goodbay = 'До свидания! До новых встреч!'
add_ok = 'успешно добавлен в книгу!'
print_contact = 'Контакт'
del_ok = 'успешно удален!'
replace_ok = 'успешно изменен!'

main_menu = '''Главное меню:
    1. Открыть файл
    2. Сохранить файл
    3. Показать все контакты
    4. Создать контакт
    5. Найти контакт
    6. Изменить контакт
    7. Удалить контакт
    8. Выход'''